podonoghue/usbdm-firmware/Usbdm_Kinetis_OpenSDA_V5/Project_Headers/adc.h
/**
 * @file     adc.h (180.ARM_Peripherals/Project_Headers/adc.h)
 * @brief    ADC routines
 *
 * @version  V4.12.1.80
 * @date     13 April 2016
 */
#ifndef HEADER_ADC_H
#define HEADER_ADC_H
/*
 * *****************************
 * *** DO NOT EDIT THIS FILE ***
 * *****************************
 *
 * This file is generated automatically.
 * Any manual changes will be lost.
 */
#include <climits>
#include <cstddef>
#include "pin_mapping.h"
#include "gpio.h"

#if false // /ADC/enablePeripheralSupport

namespace USBDM {

/**
 * @addtogroup ADC_Group ADC, Analogue Input
 * @brief Abstraction for Analogue Input
 * @{
 */

/**
 * Provides:
 * - Common unhandledCallback for all ADCs.
 * - Shared constants
 *
 * This class is not intended to be instantiated directly.
 */
class Adc {

public:

   /// Pointer to hardware instance
   const HardwarePtr<ADC_Type> adc;

private:
   Adc(const Adc&) = delete;
   Adc(Adc&&) = delete;

protected:

   // Channel number used for PGA
   static constexpr uint32_t PGA_CHANNEL = 2;

   /**
    * Limit channel to permitted range.
    * Used to prevent noise from static assertion checks that detect a condition already detected in a more useful fashion.
    *
    * @param channel   Channel number to limit
    *
    * @return Index limited to permitted range
    */
   template<class Info>
   static inline constexpr int limitIndex(int channel) {
      if (channel<0) {
         return 0;
      }
      if (channel>(Info::numSignals-1)) {
         return Info::numSignals-1;
      }
      return channel;
   }

   /** Class to static check channel exists and is mapped to an input pin */
   CreatePeripheralPinChecker("ADC");

   /**
    * Constructor
    *
    * @param adcBaseAddress Base address of ADC hardware
    */
   constexpr  Adc(uint32_t adcBaseAddress) : adc(adcBaseAddress) {
   }

   /**
    * Initiates a conversion but does not wait for it to complete.
    * Intended for use with interrupts or DMA.
    *
    * @param[in] sc1Value SC1 register value. This includes channel, differential mode and interrupts enable.
    */
   void startConversion(const int sc1Value) const {
      // Trigger conversion
      adc->SC1[0] = sc1Value;
   };

   /**
    * Initiates a conversion and waits for it to complete.
    *
    * @param[in] sc1Value SC1 register value including the ADC channel to use and differential mode
    *
    * @return - The result of the conversion as an integer converted from 16-bit ADC value
    *           For single-ended conversions this will be zero extended
    *           For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended conversions.
    */
   int readAnalogue(uint32_t sc1Value) const {

      // Trigger conversion
      adc->SC1[0] = sc1Value;
      (void)adc->SC1[0];

      while ((adc->SC1[0]&ADC_SC1_COCO_MASK) == 0) {
         __asm__("nop");
      }

      return getConversionResult();
   };

   /**
    * Initiates a conversion and waits for it to complete.
    *
    * @param[in] sc1Value SC1 register value including the ADC channel to use and differential mode
    * @param[in] adcResolution Resolution for converter e.g. AdcResolution_16bit_se
    *
    * @return - The result of the conversion as an integer converted from 16-bit ADC value
    *           For single-ended conversions this will be zero extended
    *           For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended conversions.
    * @note The resolution used affects all future conversion on all channels on the ADC
    */
   int readAnalogue(uint32_t sc1Value, AdcResolution adcResolution) const {
      adc->CFG1 = (adc->CFG1&~ADC_CFG1_MODE_MASK)|adcResolution;
      return readAnalogue(sc1Value);
   };

public:

   /**
    * Enables hardware trigger mode of operation and configures the channel.
    *
    * @param[in] sc1Value        SC1 register value including the ADC channel, Differential mode and interrupt enable
    * @param[in] adcPretrigger   Hardware pre-trigger to use for this channel

    *                            This corresponds to pre-triggers in the PDB channels and SC1[n] register setups
    */
   void enableHardwareConversion(int sc1Value, AdcPretrigger adcPretrigger) const {
      // Set hardware triggers
      adc->SC2 = (adc->SC2)|ADC_SC2_ADTRG(1);
      // Configure channel for hardware trigger input
      adc->SC1[adcPretrigger] = sc1Value;
   }
   
   /**
    * Enables hardware trigger mode of operation and configures the channel.
    *
    * @param[in] sc1Value        SC1 register value including the ADC channel, Differential mode and interrupt enable
    * @param[in] adcPretrigger   Hardware pre-trigger to use for this channel.

    *                            This corresponds to pre-triggers in the PDB channels and SC1[n] register setups
    * @param[in] adcDma          Whether to generate a DMA request when each conversion completes
    */
   void enableHardwareConversion(int sc1Value, AdcPretrigger adcPretrigger, AdcDma adcDma) const {
      // Set hardware triggers
      adc->SC2 = (adc->SC2)|ADC_SC2_ADTRG(1)|adcDma;
      // Configure channel for hardware trigger input
      adc->SC1[adcPretrigger] = sc1Value;
   }
   
   /**
    * Enable/disable DMA.
    *
    * @param[in] adcDma  Controls DMA operation.
    */
   void enableDma(AdcDma adcDma = AdcDma_Enabled) const {
      // Set up DMA
      if (adcDma) {
         adc->SC2 = adc->SC2 | ADC_SC2_DMAEN_MASK;
      }
      else {
         adc->SC2 = adc->SC2 & ~ADC_SC2_DMAEN_MASK;
      }
   }   

   /**
    * Set resolution
    *
    * @param[in] adcResolution Resolution for converter e.g. AdcResolution_16bit_se
    *
    * @note This affects all channels on the ADC
    */
   void setResolution(AdcResolution adcResolution) const {
      adc->CFG1 = (adc->CFG1&~ADC_CFG1_MODE_MASK)|adcResolution;
   }

   /**
    * Set averaging mode
    *
    * @param[in] adcAveraging Mode for averaging e.g. AdcAveraging_4 etc
    *
    * @note This affects all channels on the ADC
    */
   void setAveraging(AdcAveraging adcAveraging) const {
      adc->SC3 = (adc->SC3&~(ADC_SC3_AVGE_MASK|ADC_SC3_AVGS_MASK))|adcAveraging;
   }

   /**
    * Set ADC  (and PGA if present) voltage reference
    *
    * @param adcRefSel Reference to select
    *
    * @note The PGA requires use of AdcRefSel_VrefOut (~1.2V)
    */
   void setReference(AdcRefSel adcRefSel=AdcRefSel_Default) {
      adc->SC2 = (adc->SC2&~ADC_SC2_REFSEL_MASK)|adcRefSel;
   }

   /**
    * Configure comparison mode.
    *
    * @param[in] adcCompare   Comparison operation to enable
    * @param[in] low          Lower threshold
    * @param[in] high         Higher threshold (if needed)
    */
   void enableComparison(AdcCompare adcCompare, int low=INT_MIN, int high=INT_MAX) const {

      usbdm_assert (low<=high, "ADC Low level > high level");

      // Juggle CV1, CV2 values to satisfy comparison rules
      switch (adcCompare) {
         case AdcCompare_Disabled:
            break;
         case AdcCompare_LessThan:
         case AdcCompare_GreaterThanOrEqual:
            adc->CV1 = low;
            break;
         case AdcCompare_OutsideRangeExclusive:
         case AdcCompare_InsideRangeInclusive:
            adc->CV1 = low;
            adc->CV2 = high;
            break;
         case AdcCompare_InsideRangeExclusive:
         case AdcCompare_OutsideRangeInclusive:
            adc->CV1 = high;
            adc->CV2 = low;
            break;
      }
      // Set comparison fields
      adc->SC2 = adc->SC2 | (adc->SC2&~(ADC_SC2_ACFE(1)|ADC_SC2_ACFGT(1)|ADC_SC2_ACREN(1)))|
            (adcCompare&(ADC_SC2_ACFE(1)|ADC_SC2_ACFGT(1)|ADC_SC2_ACREN(1)));
   }

   /**
    * Enable/disable continuous conversion mode.
    *
    * @param[in] adcContinuous  Controls continuous conversion mode.
    */
   void enableContinuousConversions(AdcContinuous adcContinuous = AdcContinuous_Enabled) const {
      if (adcContinuous) {
         adc->SC3 = adc->SC3 | ADC_SC3_ADCO_MASK;
      }
      else {
         adc->SC3 = adc->SC3 & ~ADC_SC3_ADCO_MASK;
      }
   }

   /**
    * Gets result of last software initiated conversion
    *
    * @return The result of the conversion as an integer converted from 16-bit ADC value\n
    *         For single-ended conversions this will be zero extended\n
    *         For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended conversions.
    * @note This will also clear the conversion flag if set
    */
   int getConversionResult() const {

      // This is a 32-bit value with leading zeroes i.e unsigned
      int value = ADC_R_D_MASK & (adc->R[0]);

#if defined(ADC_SC1_DIFF_MASK)
      if (adc->SC1[0] & ADC_SC1_DIFF_MASK) {
         // Differential conversion - convert to signed
         return static_cast<int16_t>(value);
      }
#endif

      return value;
   };

   /**
    * Gets result of hardware initiated conversion
    *
    * @param preTrigger Pretrigger to use (identifies which SC1 register to access)
    *
    * @return The result of the conversion as an integer converted from 16-bit ADC value\n
    *         For single-ended conversions this will be zero extended\n
    *         For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended conversions.
    * @note This will also clear the conversion flag if set
    */
   int getHardwareConversionResult(AdcPretrigger preTrigger) const {

      // This is a 32-bit value with leading zeroes i.e unsigned
      int value = ADC_R_D_MASK & (adc->R[preTrigger]);

#if defined(ADC_SC1_DIFF_MASK)
      if (adc->SC1[preTrigger] & ADC_SC1_DIFF_MASK) {
         // Differential conversion - convert to signed
         return static_cast<int16_t>(value);
      }
#endif

      return value;
   };

   /**
    * Check if ADC is current doing a conversion
    *
    * @return true   => ADC is busy doing a conversion
    * @return false  => ADC is idle
    */
   bool isBusy() const {
      return adc->SC2&ADC_SC2_ADACT_MASK;
   }

#if defined(ADC_PGA_PGAEN_MASK)
#if defined(ADC_PGA_PGACHPb_MASK)
      /**
       * Configure Programmable Gain Amplifier.
       * Only affects the single channel associated with the PGA.
       *
       * @param adcPgaMode Mode to operate in (or disabled)
       * @param adcPgaGain Gain
       * @param adcPgaChop PGA chopping control
       *
       * @note Chopping should only be used in conjunction with even-numbered averaging
       *       since the chopping is applied between consecutive conversions.
       */
      void configurePga(AdcPgaMode adcPgaMode, AdcPgaGain adcPgaGain=AdcPgaGain_1, AdcPgaChop adcPgaChop=AdcPgaChop_Enabled) const {
         adc->PGA = adcPgaMode|adcPgaGain|adcPgaChop;
      }

      /**
       * Measure PGA offset
       * The PGA should be configured for intended use before doing this.
       *
       * @note  If chopping is enabled, then the returned value represents the residual offset after
       *        chopping and can be applied to correct later conversions done with chopping enabled.
       *        If chopping is disabled, then the return value is the entire offset and may be
       *        applied to correct conversions with chopping disabled.
       *
       * @note To apply offset correction subtract <b>[(pga_offset_measurement*(Gain+1))/(64+1)]</b> from
       *       the ADC result, where Gain is the PGA gain during actual ADC operation.
       *
       * @return Offset measurement. (pga_offset * (64+1))
       */
      int measurePgaOffset() const {
         adc->PGA = adc->PGA | ADC_PGA_PGAOFSM_MASK;
         int offset = readAnalogue(PGA_CHANNEL);
         adc->PGA = adc->PGA & ~ADC_PGA_PGAOFSM_MASK;
         return offset;
      }
#else
      /**
       * Configure Programmable Gain Amplifier.
       * Only affects the single channel associated with the PGA.
       *
       * @param adcPgaMode Mode to operate in (or disabled)
       * @param adcPgaGain Gain
       */
      void configurePga(AdcPgaMode adcPgaMode, AdcPgaGain adcPgaGain=AdcPgaGain_x1) const {
         adc->PGA = adcPgaMode|adcPgaGain;
      }
#endif
#endif

