podonoghue/usbdm-firmware/Usbdm_Kinetis_OpenSDA_V5/Project_Headers/adc.h
      // Set comparison fields
      adc->SC2 = adc->SC2 | (adc->SC2&~mask)|(adcCompare&mask);
   }

   /**
    * Enable/disable continuous conversion mode.
    *
    * @param[in] adcContinuous  Controls continuous conversion mode.
    */
   static void enableContinuousConversions(AdcContinuous adcContinuous) {
      if (adcContinuous) {
         adc->SC3 = adc->SC3 | ADC_SC3_ADCO_MASK;
      }
      else {
         adc->SC3 = adc->SC3 & ~ADC_SC3_ADCO_MASK;
      }
   }

#ifdef ADC_SC2_DMAEN_MASK
   /**
    * Enable/disable DMA.
    *
    * @param[in] adcDma  Controls DMA operation.
    */
   static void enableDma(AdcDma adcDma = AdcDma_Enabled) {
      // Set up DMA
      if (adcDma) {
         adc->SC2 = adc->SC2 | ADC_SC2_DMAEN_MASK;
      }
      else {
         adc->SC2 = adc->SC2 & ~ADC_SC2_DMAEN_MASK;
      }
   }
#endif

protected:
   /**
    * Enables hardware trigger mode of operation and configures the channel.
    *
    * @param[in] sc1Value        SC1 register value including the ADC channel, Differential mode and interrupt enable
    * @param[in] adcPretrigger   Hardware pre-trigger to use for this channel\n
    *                            This corresponds to pre-triggers in the PDB channels and SC1[n] register setups
    */
   static void enableHardwareConversion(int sc1Value, AdcPretrigger adcPretrigger) {
      // Set hardware triggers
      adc->SC2 = (adc->SC2)|ADC_SC2_ADTRG(1);
      // Configure channel for hardware trigger input
      adc->SC1[adcPretrigger] = sc1Value;
   }

#ifdef ADC_SC2_DMAEN
   /**
    * Enables hardware trigger mode of operation and configures the channel.
    *
    * @param[in] sc1Value        SC1 register value including the ADC channel, Differential mode and interrupt enable
    * @param[in] adcPretrigger   Hardware pre-trigger to use for this channel.\n
    *                            This corresponds to pre-triggers in the PDB channels and SC1[n] register setups
    * @param[in] adcDma          Whether to generate a DMA request when each conversion completes
    */
   static void enableHardwareConversion(int sc1Value, AdcPretrigger adcPretrigger, AdcDma adcDma) {
      // Set hardware triggers
      adc->SC2 = (adc->SC2)|ADC_SC2_ADTRG(1)|adcDma;
      // Configure channel for hardware trigger input
      adc->SC1[adcPretrigger] = sc1Value;
   }
#endif
   /**
    * Initiates a conversion but does not wait for it to complete.
    * Intended for use with interrupts or DMA.
    *
    * @param[in] sc1Value SC1 register value.
    *                     This includes channel, differential mode and interrupts enable.
    * @param adcResolution      New Resolution to use (persistent)
    */
   static void startConversion(const int sc1Value, AdcResolution adcResolution) {
      // Trigger conversion
      adc->CFG1 = (adc->CFG1&~ADC_CFG1_MODE_MASK)|adcResolution;
      adc->SC1[0] = sc1Value;
   };

   /**
    * Initiates a conversion but does not wait for it to complete.
    * Intended for use with interrupts or DMA.
    *
    * @param[in] sc1Value SC1 register value.
    *                     This includes channel, differential mode and interrupts enable.
    */
   static void startConversion(const int sc1Value) {
      // Trigger conversion
      adc->SC1[0] = sc1Value;
   };

public:
   /**
    * Gets result of last software initiated conversion
    *
    * @return - The result of the conversion as an integer converted from 16-bit ADC value\n
    *           For single-ended conversions this will be zero extended\n
    *           For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended channels.
    * @note This will also clear the conversion flag if set
    */
   static int getConversionResult() {

      // This is a 32-bit value with leading zeroes i.e unsigned
      int value = ADC_R_D_MASK & (adc->R[0]);

#if defined(ADC_SC1_DIFF_MASK)
      if (adc->SC1[0] & ADC_SC1_DIFF_MASK) {
         // Differential conversion - convert to signed
         return static_cast<int16_t>(value);
      }
#endif
      return value;
   };

   /**
    * Gets result of hardware initiated conversion
    *
    * @param pretrigger Pretrigger to use (identifies which SC1 register to access)
    *
    * @return The result of the conversion as an integer converted from 16-bit ADC value\n
    *         For single-ended conversions this will be zero extended\n
    *         For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended channels.
    * @note This will also clear the conversion flag if set
    */
   static int getHardwareConversionResult(AdcPretrigger pretrigger) {

      // This is a 32-bit value with leading zeroes i.e unsigned
      int value = ADC_R_D_MASK & (adc->R[pretrigger]);

#if defined(ADC_SC1_DIFF_MASK)
      if (adc->SC1[pretrigger] & ADC_SC1_DIFF_MASK) {
         // Differential conversion - convert to signed
         return static_cast<int16_t>(value);
      }
#endif
      return value;
   };

protected:
   /**
    * Initiates a conversion and waits for it to complete.
    *
    * @param[in] sc1Value SC1 register value including the ADC channel to use and whether differential mode
    *
    * @return - The result of the conversion as an integer converted from 16-bit ADC value\n
    *           For single-ended conversions this will be zero extended\n
    *           For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended conversions.
    */
   static int readAnalogue(const int sc1Value) {
      // Trigger conversion
      adc->SC1[0] = sc1Value;
      (void)adc->SC1[0];

      while ((adc->SC1[0]&ADC_SC1_COCO_MASK) == 0) {
         __asm__("nop");
      }

      return getConversionResult();
   };

   /**
    * Initiates a conversion and waits for it to complete.
    *
    * @param[in] sc1Value SC1 register value including the ADC channel to use and whether differential mode
    * @param[in] adcResolution Resolution for converter e.g. AdcResolution_16bit_se
    *
    * @return - The result of the conversion as an integer converted from 16-bit ADC value\n
    *           For single-ended conversions this will be zero extended\n
    *           For differential conversions this will be sign-extended
    *
    * @note Result is signed but will always be positive for single-ended conversions.
    * @note The resolution used here affects all further conversion on all channels on the ADC
    *
    */
   static int readAnalogue(const int sc1Value, AdcResolution adcResolution) {
      adc->CFG1 = (adc->CFG1&~ADC_CFG1_MODE_MASK)|adcResolution;
      return readAnalogue(sc1Value);
   }

