podonoghue/usbdm-firmware/Usbdm_Kinetis_OpenSDA_V5/Project_Headers/adc.h
public:
#if defined(ADC_PGA_PGAEN_MASK)
#if defined(ADC_PGA_PGACHPb_MASK)
      /**
       * Configure Programmable Gain Amplifier.
       * Only affects the single channel associated with the PGA.
       *
       * @param adcPgaMode Mode to operate in (or disabled)
       * @param adcPgaGain Gain
       * @param adcPgaChop PGA chopping control
       */
      static void configurePga(AdcPgaMode adcPgaMode, AdcPgaGain adcPgaGain=AdcPgaGain_1, AdcPgaChop adcPgaChop=AdcPgaChop_Enabled) {
         adc->PGA = adcPgaMode|adcPgaGain|adcPgaChop;
      }

      /**
       * Measure PGA offset
       * The PGA should be configured for intended use before doing this.
       *
       * @note  If chopping is enabled, then the returned value represents the residual offset after
       *        chopping and can be applied to correct later conversions done with chopping enabled.
       *        If chopping is disabled, then the return value is the entire offset and may be
       *        applied to correct conversions with chopping disabled.
       *
       * @note To apply offset correction subtract <b>[(pga_offset_measurement*(Gain+1))/(64+1)]</b> from
       *       the ADC result, where Gain is the PGA gain during actual ADC operation.
       *
       * @return Offset measurement. (pga_offset * (64+1))
       */
      static int measurePgaOffset() {
         adc->PGA = adc->PGA | ADC_PGA_PGAOFSM_MASK;
         int offset = readAnalogue(PGA_CHANNEL);
         adc->PGA = adc->PGA & ~ADC_PGA_PGAOFSM_MASK;
         return offset;
      }
#else
      /**
       * Configure Programmable Gain Amplifier.
       * Only affects the single channel associated with the PGA.
       *
       * @param adcPgaMode Mode to operate in (or disabled)
       * @param adcPgaGain Gain
       */
      static void configurePga(AdcPgaMode adcPgaMode, AdcPgaGain adcPgaGain=AdcPgaGain_x1) {
         adc->PGA = adcPgaMode|adcPgaGain;
      }
#endif
#endif

   /**
    * Template class representing an ADC channel.
    *
    * Example
    * @code
    * // Instantiate the ADC and the channel (for ADC0 channel 6)
    * using Adc0    = AdcBase_T<Adc0Info>;
    * using Adc0Ch6 = Adc0::Channel<6>;
    *
    * // Set ADC resolution
    * Adc0::setMode(AdcResolution_16bit_se);
    *
    * // Read ADC value
    * uint32_t value = Adc0Ch6::readAnalogue();
    * @endcode
    *
    * @tparam channel ADC channel
    */
   template<AdcChannelNum channel>
   class ChannelCommon : public AdcChannel {
   private:
      /**
       * This class is not intended to be instantiated
       */
      ChannelCommon(const ChannelCommon&) = delete;
      ChannelCommon(ChannelCommon&&) = delete;

   public:
      constexpr ChannelCommon() : AdcChannel(AdcInfo::baseAddress, channel) {}

      /** The ADC that owns this channel */
      using Owner = AdcBase_T;

      /** Information about this ADC */
      using AdcInfo = Info;

      /** Channel number */
      static constexpr AdcChannelNum CHANNEL=channel;

      /**
       * Initiates a conversion but does not wait for it to complete.
       * Intended for use with interrupts or DMA.
       *
       * @param[in] adcInterrupt   Determines if an interrupt is generated when conversions are complete
       */
      static void startConversion(AdcAction adcInterrupt=AdcAction_None) {
         if constexpr(!Info::irqHandlerInstalled) {
            usbdm_assert((adcInterrupt == AdcAction_None),
                  "ADC not configured for interrupts. Modify Configure.usbdmProject");
         }
         AdcBase_T::startConversion(mapChannelNumToPhysicalChannelNum(channel)|adcInterrupt);
      };

      /**
       * Initiates a conversion but does not wait for it to complete.
       * Intended for use with interrupts or DMA.
       *
       * @param adcResolution      New Resolution to use (persistent)
       * @param[in] adcInterrupt   Determines if an interrupt is generated when conversions are complete
       */
      static void startConversion(AdcResolution adcResolution, AdcAction adcInterrupt=AdcAction_None) {
         if constexpr(!Info::irqHandlerInstalled) {
            usbdm_assert((adcInterrupt == AdcAction_None),
                  "ADC not configured for interrupts. Modify Configure.usbdmProject");
         }
         AdcBase_T::startConversion(mapChannelNumToPhysicalChannelNum(channel)|adcInterrupt, adcResolution);
      };

      /**
       * Initiates a conversion and waits for it to complete.
       *
       * @return - The result of the conversion as an integer converted from 16-bit ADC value\n
       *           For single-ended conversions this will be zero extended\n
       *           For differential conversions this will be sign-extended
       *
       * @note Result is signed but will always be positive for single-ended conversions.
       */
      static int readAnalogue() {
         return AdcBase_T::readAnalogue(mapChannelNumToPhysicalChannelNum(channel));
      };
      /**
       * Initiates a conversion and waits for it to complete.
       *
       * @param[in] adcResolution Resolution for converter e.g. AdcResolution_16bit_se
       *
       * @return - The result of the conversion as an integer converted from 16-bit ADC value\n
       *           For single-ended conversions this will be zero extended\n
       *           For differential conversions this will be sign-extended
       *
       * @note Result is signed but will always be positive for single-ended conversions.
       * @note The resolution used here affects all further conversion on all channels on the ADC
       */
      static int readAnalogue(AdcResolution adcResolution) {
         return AdcBase_T::readAnalogue(mapChannelNumToPhysicalChannelNum(channel), adcResolution);
      };

      /**
       * Enables hardware trigger mode of operation and configures a channel.
       *
       * @param[in] adcPretrigger   Hardware pre-trigger to use for this channel.\n
       *                            This corresponds to pre-triggers in the PDB channels and SC1[n]/R[n] register selection
       * @param[in] adcInterrupt    Whether to generate an interrupt when each conversion completes
       */
      static void enableHardwareConversion(AdcPretrigger adcPretrigger, AdcAction adcInterrupt=AdcAction_None) {
         AdcBase_T::enableHardwareConversion(mapChannelNumToPhysicalChannelNum(channel)|adcInterrupt, adcPretrigger);
      }

#ifdef ADC_SC2_DMAEN
      /**
       * Enables hardware trigger mode of operation and configures a channel.
       *
       * @param[in] adcPretrigger   Hardware pre-trigger to use for this channel\n
       *                            This corresponds to pre-triggers in the PDB channels and SC1[n]/R[n] register selection
       * @param[in] adcInterrupt    Whether to generate an interrupt when each conversion completes
       * @param[in] adcDma          Whether to generate a DMA request when each conversion completes
       */
      static void enableHardwareConversion(AdcPretrigger adcPretrigger, AdcAction adcInterrupt, AdcDma adcDma) {
         AdcBase_T::enableHardwareConversion(mapChannelNumToPhysicalChannelNum(channel)|adcInterrupt, adcPretrigger, adcDma);
      }
#endif
   };

   template<AdcChannelNum channel>
   class Channel : public ChannelCommon<channel>  {
   private:
      /**
       * This class is not intended to be instantiated
       */
      Channel(const Channel&) = delete;
      Channel(Channel&&) = delete;

